In [5]:
import pandas as pd
import numpy as np

## 1. Membuat DataFrame dari sebuah array

### 1.1. Option 1

In [ ]:
# membuat data array
data = np.array([[1,4], [2,5], [3,6]])

In [ ]:
# membuat dataframe
df = pd.DataFrame(data, index=["row1", "row2", "row3"], columns=["col1","col2"])

In [ ]:
#menampilkan dataframe
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

### 1.2 Option 2

In [ ]:
# creating an array with list shape
data = [[1,4], [2,5], [3,6]]

In [18]:
# creating a dataframe
df = pd.DataFrame(data, index=["row1", "row2", "row3"], columns=["col1","col2"])

In [19]:
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

## 2. membuat dataframe dari sebuah dictionary

In [12]:
# contoh lists
kota = ["Bandung","Bukittinggi","Yogyakarta","Ternate"]
populasi = [1232,3527,26816,2423]

In [13]:
#mengabungkan list di dictonary
dic_kota = {"Kota":kota,"Populasi":populasi}

In [16]:
#membuat dataframe
df_populasi = pd.DataFrame(dic_kota)

In [17]:
#menampilkan dataframe
df_populasi

          Kota  Populasi
0      Bandung      1232
1  Bukittinggi      3527
2   Yogyakarta     26816
3      Ternate      2423

## 3. Membuat DataFrame dari CSV

In [ ]:
# import file csv
df_ujian_siswa = pd.read_csv("StudentsPerformance.csv")

In [ ]:
# menampilkan 5 data teratas
df_ujian_siswa.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75